---
kind: other
id: Properties.T:Autodesk.Revit.DB.AssemblyMemberDifferentType
source: html/fe1bf935-88c7-8b1c-4ce3-9c533db1835f.htm
---
# AssemblyMemberDifferentType Properties

Specifies whether the .NET object represents a valid Revit entity.